system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     buoyantSimpleFoam;

startFrom       latestTime;

startTime       103200;

stopAt          endTime;

endTime         120000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      2;

writeFormat     ascii;

writePrecision  15;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable false;


 /*
functions
{

		#includeFunc cuttingPlane
	
	  residuals
    {
        type           residuals;
        functionObjectLibs ("libutilityFunctionObjects.so");
        enabled        true;
        writeControl   timeStep;
        writeInterval  1;
        fields
        (
            U  
            p
            k
            epsilon
            
           
        );
}

   turbulenceFields1
    {
        type            turbulenceFields;
        libs            ("libfieldFunctionObjects.so");
        field           R;
    }


}


// ************************************************************************* //
