constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS
{
    RASModel        LaunderSharmaKE;//ManceauLardeau;//ManceauLardeau;//LaunderSharmaKE;//lienNRGKEpsilon;

    turbulence      on;

    printCoeffs     on;

  /* SSG true;
   CL  0.133;
   Cmu 0.21;
   sigmaK 1.0;
   sigmaEps 1.15;
   C2 1.83;
*/
}


// ************************************************************************* //
