0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;


boundaryField
{
    sidey_plus
    {
        type            cyclicAMI;
    }

    sidey_minus
    {
        type            cyclicAMI;
    }

    sidex_plus
    {
        type            cyclicAMI;
    }

    sidex_minus
    {
        type            cyclicAMI;
    }

    front
    {
        type            cyclicAMI;

    }

    back
    {
        type            cyclicAMI;

    }

    cylinderWalls
    {
        type            fixedFluxPressure;
    }

}



// ************************************************************************* //
