0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];



internalField   uniform 3000;


boundaryField
{
    sidey_plus
    {
        type            cyclicAMI;
    }

    sidey_minus
    {
        type            cyclicAMI;
    }

    sidex_plus
    {
        type            cyclicAMI;
    }

    sidex_minus
    {
        type            cyclicAMI;
    }

    front
    {
        type            cyclicAMI;

    }

    back
    {
        type            cyclicAMI;

    }

    cylinderWalls
    {
        type            externalWallHeatFluxTemperature;
        mode            flux;
        q               uniform 360000;
        qr              none;
        value           uniform 3000;
    }

}



// ************************************************************************* //
