0/kt
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
    sidey_plus
    {
        type            cyclicAMI;
    }

    sidey_minus
    {
        type            cyclicAMI;
    }

    sidex_plus
    {
        type            cyclicAMI;
    }

    sidex_minus
    {
        type            cyclicAMI;
    }

    

    front
    {
        type            cyclicAMI;

    }


    back
    {
        type            cyclicAMI;

    }


    cylinderWalls
    {
        type        kLowReWallFunction;
        value       uniform     1e-10;
    }

}



// ************************************************************************* //
