system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          fvSchemes;
}

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    unlimitedGrad(U) Gauss linear;
}

divSchemes
{
    default         Gauss linear;
    div(phi,U)      bounded Gauss upwind;
    turbulence      bounded Gauss upwind;
    div(phi,k)      bounded Gauss upwind;
    div(phi,h)      bounded Gauss upwind;
    div(phi,R)      bounded Gauss upwind;
    div(phi,K)      bounded Gauss limitedLinear 1;
    div(phi,omega)  bounded Gauss limitedLinear 1;
    div(phi,nuTilda) bounded Gauss limitedLinear 1;
    div(phi,epsilon) bounded Gauss upwind;
    div(phi,phit)   bounded Gauss limitedLinear 1;
    div(phi,f)      bounded Gauss limitedLinear 1;
    div(phi,gammaInt) bounded Gauss linearUpwind grad;
    div(phi,ReThetat) bounded Gauss linearUpwind grad;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U)))))  Gauss linear;
    div(((rho*(thermo:mu|rho))*dev2(T(grad(U)))))  Gauss linear;
    div((rho*R)) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.33;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.33;
}

wallDist
{
    method          meshWave;
}

geometry
{
    type            highAspectRatio;
    minAspect       10;
    maxAspect       100;
}


// ************************************************************************* //
