system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;

        smoother         DICGaussSeidel;

    }

    "(U|h|k|epsilon|omega|R|kt|epsilont)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }

    "(alphaEB)"
    {
        solver          PCG;
        preconditioner  diagonal;
        tolerance       1e-08;
        relTol          0.0;
    }




}





SIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p_rgh           1e-6;
        U               1e-6;
        h               1e-8;

        // possibly check turbulence fields
        "(k|epsilon|omega)" 1e-6;
    }
}

relaxationFactors
{
    fields
    {
        rho             1.0;
        p_rgh           0.3;
    }
    equations
    {
        U               0.7;
        h               0.7;
        R               0.2;
        "(k|epsilon|omega|kt|epsilont)" 0.5;
        "(alphaEB)"   0.95;
    }
}


// ************************************************************************* //
