system/turbulenceFields1
turbulenceFields1
{
    // Mandatory entries (unmodifiable)
    type            turbulenceFields;
    libs            ("libfieldFunctionObjects.so");

    // Mandatory entries (runtime modifiable)
    // Either field or fields entries
    fields          (R);
    field           R;


}
